---
kind: property
id: P:Autodesk.Revit.UI.UIDocument.Selection
source: html/4f5f9d48-c094-4aa6-ce7c-7d347a567244.htm
---
# Autodesk.Revit.UI.UIDocument.Selection Property

Retrieve the currently selected Elements in Autodesk Revit.

## Syntax (C#)
```csharp
public Selection Selection { get; }
```

## Remarks
Returns an object that represents the active selection. The Selection property returns an
object that represents the active selection when the command was started.